[
  {
    "id": "ai-study-buddy",
    "title": "AI Study Buddy",
    "shortDesc": "Personalized AI tutor that adapts to your learning style with quizzes and explanations.",
    "tech": ["React", "TensorFlow.js", "Node.js", "Python"],
    "date": "2025-03-15",
    "image": "https://www.usmsystems.com/wp-content/uploads/2020/09/119226200_665027644365313_4663085420677003994_n.jpg",
    "details": [
      "Uses machine learning to create custom study plans based on quiz performance.",
      "Analyzes learning style and suggests interactive resources like flashcards and videos.",
      "Real-time progress tracking with analytics dashboard for students at Gyan Niketan.",
      "Integrates TensorFlow.js for browser-based AI without server dependency.",
      "Supports multiple subjects with adaptive difficulty levels.",
      "Exports reports as PDF for teachers to review student growth."
    ]
  },
  {
    "id": "school-portal",
    "title": "School Portal",
    "shortDesc": "Modern web portal for student attendance, grades, and announcements—streamlining school admin.",
    "tech": ["React", "Firebase", "Tailwind CSS", "TypeScript"],
    "date": "2025-02-20",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQLTyAutqWXgstJyfD1A6tAXpYuVNGpUeIi22v91wsg9A&s=10",
    "details": [
      "Responsive dashboard for teachers to post grades and announcements securely.",
      "Students access personalized views with real-time notifications via Firebase.",
      "Reduces paperwork by 70% with mobile-friendly attendance tracking and QR scans.",
      "Uses TypeScript for type-safe code and Tailwind for rapid, consistent styling.",
      "Role-based access: Admins manage users, parents view reports.",
      "Integrates email/SMS alerts for low grades or absences."
    ]
  },
  {
    "id": "weather-dashboard",
    "title": "Weather Dashboard",
    "shortDesc": "Real-time weather tracker with forecasts, maps, and alerts—using open APIs for global data.",
    "tech": ["React", "OpenWeatherMap API", "Chart.js", "Tailwind CSS"],
    "date": "2025-03-25",
    "image": "https://images.unsplash.com/photo-1506905925346-21bda4d32df4?ixlib=rb-4.0.3&auto=format&fit=crop&w=400&h=300&q=80",
    "details": [
      "Search any city for hourly forecasts and interactive temperature charts.",
      "Integrates OpenWeatherMap API for accurate global data and severe weather alerts.",
      "Visualizes trends with Chart.js for humidity, wind, and precipitation patterns.",
      "Push notifications for storms or temperature extremes via browser alerts.",
      "Map integration with Leaflet for location-based forecasts.",
      "Historical data comparison to track climate changes over time."
    ]
  },
  {
    "id": "chatbot-assistant",
    "title": "Chatbot Assistant",
    "shortDesc": "AI-powered school helper for queries on schedules, homework, and resources—conversational interface.",
    "tech": ["JavaScript", "Dialogflow", "React", "WebSockets"],
    "date": "2025-05-05",
    "image": "https://imageio.forbes.com/specials-images/imageserve/64c2d5d97f8b3786fc03e3c3/AI-Technology-Innovation-concept/960x0.jpg?height=399&width=711&fit=bounds",
    "details": [
      "Conversational UI for instant answers on homework and school schedules.",
      "Dialogflow handles NLP to process queries and integrate with school calendars.",
      "Real-time responses via WebSockets for seamless, lag-free chat experience.",
      "Trained on FAQs and resources—ideal for student support without human intervention.",
      "Multi-language support for diverse student queries.",
      "Logs interactions for admins to improve bot accuracy over time."
    ]
  }
]